""" Инициалы.
    Напишите функцию print_initials(name, surname, middlename), которая принимает три параметра:
name – имя человека;
surname – фамилия человека;
middlename – отчество человека;
а затем выводит на печать фамилию и инициалы в определенном формате (первая буква фамилии должна стать заглавной, все
остальные строчные; в имени и отчестве остаются только по одной букве в верхнем регистре).
Ваша задача дописать только тело функции print_initials"""


def print_initials(name: str, surname: str, middlename: str):
    print(surname.title(), name[0].upper() + '.' + middlename[0].upper() + '.')
