"""Напишите программу, которая вычисляет длину отрезка (т.е. расстояние между двумя точками), заданного двумя значениями
    x1 и x2 (вещественные числа)."""

x1, x2 = float(input()), float(input())
print(abs(x2 - x1))
