"""Площадь квадрата.
    Я думаю каждый знаком с квадратом - идеально симметричная и ровная фигура. Давайте напишем программу, которая
вычисляет площадь квадрата по введенной длине.
    Формула вычисления площади квадрата следующая:
S = a ** 2
    Входные данные
На вход программе поступает вещественное число а.
    Выходные данные
Программа выводит площадь квадрата"""

a = float(input())
print(a ** 2)
