"""Найдите результат выражения ∣a∣+∣b∣
Значения переменных, а и b поступают на вход в отдельных строках и могут быть только целого типа"""

a, b = int(input()), int(input())
print(abs(a) + abs(b))
