"""Дано целое положительное число, ваша задача вывести разряд сотен этого числа"""

print(int(input()) // 100 % 10)