"""Следующее четное.
    Дано целое число n. Выведите следующее за ним четное число.
Задачу необходимо решить целочисленными операциями без использования условных операторов и\или циклов"""

n = int(input())
print(n // 2 * 2 + 2)
