""" Слияние списков
    В вашем распоряжении имеется два отсортированных списка по неубыванию элементов, состоящих из n и m элементов. Ваша
задача слить их в один отсортированный список размером n + m
    Входные данные:
    Программа получает на вход два числа n и m - количество элементов первого списка и второго списков. Затем с новой
строки поступают элементы первого отсортированного списка, а со следующей строки - второго списка
    Выходные данные:
    Слить два списка в один в порядке неубывания и вывести элементы полученного списка
P.S.: пользоваться встроенной сортировкой запрещено"""

n, m = map(int, input().split())
lst = list(map(int, input().split())) + list(map(int, input().split()))
lst_new = []
while len(lst) > 0:
    lst_new.append(min(lst))
    lst.remove(min(lst))
print(*lst_new)
