"""Программа получает на вход строку. Ваша задача развернуть строку и вывести ее на экран."""

print(input()[::-1])
