# Программа получает на вход строку и ваша задача вывести последние 4 символа этой строки
# Гарантируется, что вводится будет строка длиной не менее 4 символов

print(input()[-4:])
