"""Программа получает на вход строку и ваша задача вывести последний символ этой строки"""

print(input()[-1])
