""" Подвиг 4. Вводится порядковый номер дня недели (1, 2, ..., 7). Вывести на
экран его название (понедельник, вторник, среда, четверг, пятница, суббота,
воскресенье). Программу реализовать с использованием операторов if-elif."""

week = ["", "понедельник", "вторник", "среда", "четверг", "пятница", "суббота",
        "воскресенье"]
day = int(input())
if day == 1:
    print(week[1])
elif day == 2:
    print(week[2])
elif day == 3:
    print(week[3])
elif day == 4:
    print(week[4])
elif day == 5:
    print(week[5])
elif day == 6:
    print(week[6])
elif day == 7:
    print(week[7])
