""" Подвиг 12. Составить программу вывода на экран вещественного числа,
вводимого с клавиатуры. Выводимому числу должно предшествовать сообщение
"Вы ввели число" (без кавычек)."""

print('Вы ввели число', float(input()))
