"""Перед вами персонажи одного знаменитого сериала. Один из главных героев любит в конце своего предложения вставлять
фразу «Сказала она!»
    Давайте и мы напишем такую программу. Она принимает на вход предложение и затем печатает его с фразой «Сказала она!»
в конце определенным образом (см. примеры). Пользуйтесь аргументом end и следите за символами, которые печатаются.
    А вы знаете, что это сериал? Если нет, то попробуйте в комментариях угадать его название.
    А для тех кто знает этот шедевр, жду в комментариях ответа на вопросы «Кто твой любимый персонаж?» или
«Какой любимый момент?»"""

print(input(), end='Сказала она!')
