""" Напишите функцию exponentiation, которая принимает на вход целое число и выводит на экран через пробел квадрат и
куб этого числа.
Вам необходимо написать только определение функции exponentiation"""


def exponentiation(x):
    print(x ** 2, x ** 3)
