""" Подвиг 6. Напишите программу отображения всех символов с нечетными
индексами из введенной строки."""

print(input()[1::2])
