""" Подвиг 4. Напишите программу отображения первых четырех символов из
введенной строки. Будем полагать, что строка гарантированно длиной не менее
четырех символов."""

print(input()[:4])
