""" Заполнение соседями.
    Дана прямоугольная матрица размером NxM, в которой заполнены значения только в первом столбце и в первом ряду. Все
остальные элементы равны нулю и мы считаем их незаполненными.
    Ваша задача заполнить каждый пустой элемент путем сложения соседа слева и соседа сверху. Начинать нужно с тех
элементов, у которых оба указанных соседа заполнены (не равны нулю)
    Входные данные:
Программа сперва принимает в одной строке на вход два числа N и M - количество строк и столбцов в списке, а затем в N
строках записаны элементы списка.
    Выходные данные:
Вывести заполненную матрицу"""

row, column = map(int, input().split())
matrix = [list(map(int, input().split())) for _ in range(row)]
for i in range(1, row):
    for j in range(1, column):
        matrix[i][j] = matrix[i - 1][j] + matrix[i][j - 1]
for k in matrix:
    print(*k)
