""" Подвиг 9. Написать программу ввода строки и формирования новой строчки
вида: "Строка: <введенная строка>. Длина: <длина строки>". Результат
сформированной строки вывести на экран.
    P.S. В программе F-строки не использовать."""

text = input()
print("Строка: " + text + ". Длина:", len(text))
