"""Подвиг 5. Напишите программу ввода двух строк (каждая вводится с новой
строки) и их объединения в одну строку через пробел. Результат выведите на
экран."""

print(f'{input()} {input()}')
