""" Создайте две переменные empty и empty_too, сохраните в них значение None
При помощи оператора is выведите на первой строке результат их сравнения на равенство и затем на второй строке результат
их сравнения на неравенсто"""

empty = None
empty_too = None
print(empty is empty_too)
print(empty is not empty_too)
