""" Подвиг 9. Имеется двумерный кортеж, размером 5 x 5 элементов:
t = ((1, 0, 0, 0, 0),
     (0, 1, 0, 0, 0),
     (0, 0, 1, 0, 0),
     (0, 0, 0, 1, 0),
     (0, 0, 0, 0, 1))
Вводится натуральное число N (N < 5). Необходимо на основе кортежа t
сформировать новый аналогичный кортеж t2 размером N x N элементов.
Результат вывести на экран в виде таблицы чисел."""

t = ((1, 0, 0, 0, 0),
     (0, 1, 0, 0, 0),
     (0, 0, 1, 0, 0),
     (0, 0, 0, 1, 0),
     (0, 0, 0, 0, 1))
n = int(input())
t2 = ()
for i in range(n):
    t2 += t[i][:n],
for k in t2:
    print(*k)

# variant 2:
# t = ((1, 0, 0, 0, 0),
#      (0, 1, 0, 0, 0),
#      (0, 0, 1, 0, 0),
#      (0, 0, 0, 1, 0),
#      (0, 0, 0, 0, 1))
# n = int(input())
# t2 = ()
# for i in range(n):
#     t_temple = ()
#     for j in range(n):
#         t_temple += (t[i][j],)
#     t2 += (t_temple,)
# for k in t2:
#     print(*k)
