""" Подвиг 9. Имеется график функции f(x) = 0.5x^2 - 2. Необходимо записать
генератор, который бы выдавал значения этой функции для аргумента x в
диапазоне [a; b] с шагом 0.01. Величины a, b вводятся с клавиатуры в одну
строчку через пробел как целые числа (a< b). Вывести на экран первые 20
значений функции с точностью до сотых, взятых из генератора.

P.S. Значения функции вычислять командой:

f(x) = 0.5 * pow(x, 2) - 2.0"""

a, b = map(int, input().split())
gen = (0.5 * pow(x / 100, 2) - 2.0 for x in range(100 * a, 100 * b + 1))
print(*[round(next(gen), 2) for _ in range(20)])
