"""Создайте этот прекрасный рисунок.
/\_/\
>^,^<
 / \
(|_|)_/
Старайтесь для переноса строк использовать экранированный символ "\n"""

print('/\_/\\')
print('>^,^<')
print(' / \\')
print('(|_|)_/')
