"""На вход программе поступает строка, состоящая из произвольного количества символов. Ваша задача дополнить введенную
строку до 15 символов в том случае, когда ей не хватает длины. Дополнять ее нужно символом "-", ставя его в конец
строки. В качестве ответа нужно вывести преобразованную строку.
    Если поступала на вход строка, у которой уже имелось как минимум 15 символов, то преобразований выполнять никаких не
нужно. Выведите строку в том виде, в котором она вводилась"""

print(input().ljust(15, '-'))
