"""Напишите программу, которая проверяет состоит ли введенная строка целиком из десятичных цифр.
В качестве ответа необходимо вывести True, если условие выполняется, во всех остальных случаях нужно вывести False"""

print(input().isdigit())
