""" Создайте словарь, у которого должны быть следующие пары ключ-значения:
Ключ: name - строка, surname - строка, age - строка
Значение: Vasya - строка, Petrov - строка, 25 - целое число
Данный словарь необходимо сохранить в переменную person и затем вывести эту переменную на экран"""

# variant 1:
person = dict(name='Vasya', surname='Petrov', age=25)
print(person)
