"""Напишите программу, которая считывает с клавиатуры два слова (или фразы, неважно), после чего вы должны при помощи
операции конкатенации сцепить вторую фразу с первой и вывести результат на экран."""

text_1, text_2 = input(), input()
print(text_2 + text_1)

