"""Напишите программу, которая сначала считывает две фразы по очереди, а потом воспроизводит их в той же
последовательности, каждую на отдельной строчке."""

print(input(), input(), sep='\n')
