"""Напишите программу, которая считывает с клавиатуры фразу и выводит на экран количество символов, которое содержалось
в ней, учитывая все знаки препинания и пунктуации."""

print(len(input()))
