"""Две половинки.
На вход программе подается строка текста. Напишите программу, которая разрежет ее на две равные части,
переставит их местами и выведет на экран.
Формат входных данных
На вход программе подается строка текста.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
Примечание. Если длина строки нечетная, то длина первой части должна быть на один символ больше."""

# text = input()
# if len(text) % 2 == 0:
#     print(text[len(text) // 2:] + text[:len(text) // 2])
# else:
#     print(text[len(text) // 2 + 1:] + text[:len(text) // 2 + 1])
s = 'i Learn Python language'
print(s.capitalize())
