"""Повторяй за мной.
Напишите программу, которая считывает три строки по очереди, а затем выводит их в той же последовательности,
каждую на отдельной строчке."""
s1, s2, s3 = input(), input(), input()
print(s1)
print(s2)
print(s3)
