"""Принадлежность 3.
Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число указанным промежуткам.
-30 выколотая > < -2 закрашенная || 7 выколотая > < 25 закрашенная.
Формат входных данных
На вход программе подаётся целое число x.
Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
Примечание. Если точка выколотая, то граница не включается, если точка закрашенная, то граница включается."""

x = int(input())
if -30 < x <= -2 or 7 < x <= 25:
    print('Принадлежит')
else:
    print('Не принадлежит')
