"""Наибольшие числа 🌶️🌶️.
На вход программе подается натуральное число n, а затем n различных натуральных чисел, каждое на отдельной строке.
Напишите программу, которая выводит наибольшее и второе наибольшее число последовательности.
Формат входных данных
На вход программе подаются натуральное число n ≥ 2, а затем n различных натуральных чисел, каждое на отдельной строке.
Формат выходных данных
Программа должна вывести два наибольших числа, каждое на отдельной строке."""

n = int(input())
largest = 0
prelargest = 0
for i in range(n):
    num = int(input())
    if largest < num:
        largest, prelargest = num, largest
    elif largest > num > prelargest:
        prelargest = num
print(largest, prelargest, sep='\n')
