"""Метод append.
В вашем распоряжении список numbers. Ваша задача добавить по порядку четыре следующих элемента в конец списка: 111,
222, 789 и 201
В качестве ответа необходимо вывести измененный список numbers

numbers = [-214, 181, -139, 448, -20, -917, 32, 422, -895, 198, 284, 472, -986, -964, -989, 29]"""

numbers = [-214, 181, -139, 448, -20, -917, 32, 422, -895, 198, 284, 472, -986, -964, -989, 29]
numbers.append(111)
numbers.append(222)
numbers.append(789)
numbers.append(201)
print(numbers)
