""" Подвиг 5. На вход программы подается целое десятичное число. Используя
битовые операции, выполните умножение введенного числа на 4. Результат
отобразите на экране."""

x = int(input())
print(x << 2)
