""" В первый день спортсмен пробежал X километров. В каждый последующий день он увеличивал пробег на 15% от предыдущего
дня. Вам необходимо определить номер дня, в который пробег спортсмена составил не менее Y километров. Само число Y будет
поступать на вход программе.
    Входные данные:
Программа получает на вход два натуральных числа X и Y
    Выходные данные:
Выведите целое число – номер дня, в который спортсмен пробежал не менее Y километров."""

x, y = map(int, input().split())
days = 1
while x <= y:
    x *= 1.15
    days += 1
print(days)
