""" Напишите программу, которая распечатает все натуральные числа кратные 5 от 195 до 6785 включительно в порядке
убывания.
    Каждое число следует выводить на отдельной строчке как в примере ниже"""

i = 6785
while i >= 195:
    print(i)
    i -= 5
