""" Напишите программу, которая распечатает все натуральные числа от 1000 до 2000 включительно.
    Каждое число следует выводить на отдельной строчке как в примере ниже"""

i = 1000
while i <= 2000:
    print(i)
    i += 1
