"""Программиста Тихона попросили написать программу, которая должна была сравнивать две введенные строки на равенство,
при этом не учитывая регистр букв. Если строки вводились одинаковые, программа Тихона должна была печатать True, в
противном случае False
    Но что-то пошло не так. Тихон написал программу, в которой есть ошибки. Ваша задача исправить имеющуюся программу
так, чтобы она прошла все тесты. """

print(input().lower() == input().lower())
