"""Напишите программу, которая считывает слово, затем выводит:
«Что Вы сказали? [это слово] ? Какое интересное слово»."""

word = input()
print('Что Вы сказали? {0}? Какое интересное слово'.format(word))
